Tekla Open API Reference for Tekla Structures 2025
WpfSaveLoad.HelpFileType Property
 Gets or sets the help file type.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public WpfSaveLoad.HelpFileTypeEnum HelpFileType { get; set; }
Public Property HelpFileType As WpfSaveLoad.HelpFileTypeEnum
	Get
	Set
Property Value
Type: WpfSaveLoad.HelpFileTypeEnum
See Also
Reference
WpfSaveLoad Class
Tekla.Structures.Dialog.UIControls Namespace